import React from "react";

const Cook = () => {
    return (
    <div>
        <div class="container">
            <h1>АМЕРИКАНСКОЕ ПЕЧЕНЬЕ С КУСОЧКАМИ ШОКОЛАДА</h1>
            <h2>СОСТАВ / ИНГРЕДИЕНТЫ - Порций: 12</h2>
            <ul type="none">
                <b>
                <li>Яйца 1 шт.</li>
                <li>Сахар 80 гр</li>
                <li>Сливочное масло (мягкое) 100 гр</li>
                <li>Соль (щепотка) по вкусу</li>
                <li>Ванилин 0.2 чайн.л.</li>
                <li>Разрыхлитель 1 чайн.л.</li>
                <li>Пшеничная мука 190 гр</li>
                <li>Темный шоколад 100 гр</li>
                </b>
            </ul>
        </div>
        <div class="cooking">
            <p> <b>ШАГ 1:</b> <br/>
            Шоколад измельчите острым ножом в крошку. Чтобы это было легче сделать, можете поместить <br/>
            шоколад предварительно в морозилку на 15 минут. В твердом состоянии он лучше крошится. <br/>
            Степень измельчения выбирайте по желанию, можете сделать крошку более мелкой или покрупнее. <br/>

            <b>ШАГ 2:</b> <br/>
            Размягченное масло разотрите с сахаром. В этом случае можете воспользоваться обычной вилкой или венчиком. <br/>

            <b>ШАГ 3:</b> <br/>
            Яйцо вымойте и обсушите салфетками. В сахарно-масляную смесь добавьте яйцо. Взбейте все до  <br/>
            однородности, чтобы яйцо равномерно распределилось по всему объему массы. <br/>

            <b>ШАГ 4:</b> <br/>
            Муку предварительно смешайте с солью, разрыхлителем и ванилином и просейте в тесто. Благодаря <br/>
            просеиванию муки печенье при выпечке будет лучше подниматься. Учитывайте, что муки у вас может уйти <br/>
            больше или меньше, поэтому ориентируйтесь на консистенцию теста. Чем заменить ванилин и об особенностях <br/>
            использования в выпечке разрыхлителя читайте в отдельных статьях в конце этого рецепта. <br/>

            <b>ШАГ 5:</b> <br/>
            Быстро замесите тесто. Оно получается однородное, эластичное, маслянистое. Долго тесто не <br/>
            месите, чтобы печенье не получилось тугим. <br/>

            <b>ШАГ 6:</b> <br/>
            Добавьте в тесто шоколадную крошку. <br/>
            
            <b>ШАГ 7:</b> <br/>
            Еще раз быстро перемешайте для равномерного распределения шоколада по всему тесту. <br/>

            <b>ШАГ 8:</b> <br/>
            На застеленный пергаментом лист выкладывайте тесто ложкой, придавая печенюшкам круглую форму.  <br/>
            Я воспользовалась кулинарной формой диаметром 6 см. Выпекайте печенье в заранее разогретой до  <br/>
            190 градусов духовке около 20 минут. Точное время и температуру запекания определяйте по своей духовке.  <br/>

            <b>ШАГ 9:</b> <br/>
            Печенье не должно сильно зарумяниться, разве что немного подрумянится с краев. Если долго <br/>
            держать печенье в духовке, оно может пересохнуть, поэтому не дожидайтесь полного румянца. <br/>
            Готовое печенье достаньте из духовки, остудите и подавайте.<br/>
            </p>
            <div class="cooks">
                <img src='./cook.jpg' alt="123"></img>
                <img src='./cook2.jpg' alt="123"></img>
            </div>
            <br/>
            <h2 align="center">Приятного аппетита!</h2>
        </div>
    </div>
    );
};

export default Cook;